#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.module.vpn-manage-internal.random_id.ipsec_secret: Refreshing state... [id=CX0omE50HUM]
module.test.module.vpn-manage-internal.google_compute_route.route[0]: Refreshing state... [id=projects/cq-provider-gcp/global/routes/cq-compute-tunnel1-route1]
module.test.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-compute-subnet-01"]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-compute-subnet-01]
module.test.google_compute_router.vpn_router: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/routers/cq-us-east1-compute-vpn-router]
module.test.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/cq-provider-gcp/global/networks/cq-compute-vpc]
module.test.google_compute_target_http_proxy.gcp_compute_target_http_proxies: Refreshing state... [id=projects/cq-provider-gcp/global/targetHttpProxies/cq-target-http-proxy]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp4500: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500]
module.test.google_compute_backend_service.backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-backend-service]
module.test.module.vpn-manage-internal.google_compute_vpn_tunnel.tunnel-static[0]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1]
module.test.google_compute_backend_service.internal-backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service]
module.test.google_compute_https_health_check.backend-service-health-check: Refreshing state... [id=projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check]
module.test.module.vpn-manage-internal.google_compute_address.vpn_gw_ip: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/addresses/ip-cq-compute]
module.test.google_compute_backend_service.another-backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-another-backend-service]
module.test.google_compute_ssl_policy.ssl-policy: Refreshing state... [id=projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_esp: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp]
module.test.google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy: Refreshing state... [id=projects/cq-provider-gcp/global/targetSslProxies/cq-target-ssl-proxy]
module.test.google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert: Refreshing state... [id=projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert]
module.test.google_compute_url_map.url_map: Refreshing state... [id=projects/cq-provider-gcp/global/urlMaps/cq-urlmap]
module.test.google_compute_url_map.external_url_map: Refreshing state... [id=projects/cq-provider-gcp/global/urlMaps/cq-external-urlmap]
module.test.google_compute_target_https_proxy.gcp_compute_target_https_proxies: Refreshing state... [id=projects/cq-provider-gcp/global/targetHttpsProxies/cq-target-https-proxy]
module.test.module.vpn-manage-internal.google_compute_vpn_gateway.vpn_gateway: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute]
module.test.google_compute_instance_group.test: Refreshing state... [id=projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/cq-instance-group]
module.test.google_compute_instance.default: Refreshing state... [id=projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp500: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500]
module.test.data.google_project.project: Reading...
module.test.data.google_project.project: Read complete after 0s [id=projects/cq-provider-gcp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.test.google_compute_backend_service.another-backend-service will be destroyed
  # (because google_compute_backend_service.another-backend-service is not in configuration)
  - resource "google_compute_backend_service" "another-backend-service" {
      - affinity_cookie_ttl_sec         = 0 -> null
      - connection_draining_timeout_sec = 300 -> null
      - creation_timestamp              = "2022-05-23T03:41:47.043-07:00" -> null
      - custom_request_headers          = [] -> null
      - custom_response_headers         = [] -> null
      - enable_cdn                      = false -> null
      - fingerprint                     = "w98dmhPnXsg=" -> null
      - health_checks                   = [] -> null
      - id                              = "projects/cq-provider-gcp/global/backendServices/cq-another-backend-service" -> null
      - load_balancing_scheme           = "EXTERNAL" -> null
      - name                            = "cq-another-backend-service" -> null
      - port_name                       = "http" -> null
      - project                         = "cq-provider-gcp" -> null
      - protocol                        = "SSL" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-another-backend-service" -> null
      - session_affinity                = "NONE" -> null
      - timeout_sec                     = 30 -> null
    }

  # module.test.google_compute_backend_service.backend-service will be destroyed
  # (because google_compute_backend_service.backend-service is not in configuration)
  - resource "google_compute_backend_service" "backend-service" {
      - affinity_cookie_ttl_sec         = 0 -> null
      - connection_draining_timeout_sec = 300 -> null
      - creation_timestamp              = "2022-05-23T03:41:58.442-07:00" -> null
      - custom_request_headers          = [] -> null
      - custom_response_headers         = [] -> null
      - enable_cdn                      = false -> null
      - fingerprint                     = "6cG5tr2UDIQ=" -> null
      - health_checks                   = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check",
        ] -> null
      - id                              = "projects/cq-provider-gcp/global/backendServices/cq-backend-service" -> null
      - load_balancing_scheme           = "EXTERNAL" -> null
      - name                            = "cq-backend-service" -> null
      - port_name                       = "http" -> null
      - project                         = "cq-provider-gcp" -> null
      - protocol                        = "HTTPS" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-backend-service" -> null
      - session_affinity                = "NONE" -> null
      - timeout_sec                     = 30 -> null
    }

  # module.test.google_compute_backend_service.internal-backend-service will be destroyed
  # (because google_compute_backend_service.internal-backend-service is not in configuration)
  - resource "google_compute_backend_service" "internal-backend-service" {
      - affinity_cookie_ttl_sec         = 0 -> null
      - connection_draining_timeout_sec = 300 -> null
      - creation_timestamp              = "2022-05-23T03:41:58.354-07:00" -> null
      - custom_request_headers          = [] -> null
      - custom_response_headers         = [] -> null
      - enable_cdn                      = false -> null
      - fingerprint                     = "Jo7-GGGxBag=" -> null
      - health_checks                   = [] -> null
      - id                              = "projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
      - load_balancing_scheme           = "INTERNAL_SELF_MANAGED" -> null
      - name                            = "cq-internal-backend-service" -> null
      - port_name                       = "http" -> null
      - project                         = "cq-provider-gcp" -> null
      - protocol                        = "HTTP" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
      - session_affinity                = "NONE" -> null
      - timeout_sec                     = 30 -> null
    }

  # module.test.google_compute_https_health_check.backend-service-health-check will be destroyed
  # (because google_compute_https_health_check.backend-service-health-check is not in configuration)
  - resource "google_compute_https_health_check" "backend-service-health-check" {
      - check_interval_sec  = 60 -> null
      - creation_timestamp  = "2022-05-23T03:41:47.126-07:00" -> null
      - healthy_threshold   = 2 -> null
      - id                  = "projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check" -> null
      - name                = "cq-health-check" -> null
      - port                = 443 -> null
      - project             = "cq-provider-gcp" -> null
      - request_path        = "/" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check" -> null
      - timeout_sec         = 1 -> null
      - unhealthy_threshold = 2 -> null
    }

  # module.test.google_compute_instance.default will be destroyed
  # (because google_compute_instance.default is not in configuration)
  - resource "google_compute_instance" "default" {
      - can_ip_forward       = false -> null
      - cpu_platform         = "Unknown CPU Platform" -> null
      - current_status       = "TERMINATED" -> null
      - deletion_protection  = false -> null
      - enable_display       = false -> null
      - guest_accelerator    = [] -> null
      - id                   = "projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute" -> null
      - instance_id          = "8718984455297358340" -> null
      - label_fingerprint    = "42WmSpB8rSM=" -> null
      - labels               = {} -> null
      - machine_type         = "e2-micro" -> null
      - metadata             = {} -> null
      - metadata_fingerprint = "zuFR_-HDP94=" -> null
      - name                 = "cq-compute" -> null
      - project              = "cq-provider-gcp" -> null
      - resource_policies    = [] -> null
      - self_link            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute" -> null
      - tags                 = [
          - "health-check",
          - "ssh",
        ] -> null
      - tags_fingerprint     = "YE9oAcj-gRw=" -> null
      - zone                 = "us-east1-b" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "persistent-disk-0" -> null
          - mode        = "READ_WRITE" -> null
          - source      = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/disks/cq-compute" -> null

          - initialize_params {
              - image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20220519" -> null
              - labels = {} -> null
              - size   = 10 -> null
              - type   = "pd-standard" -> null
            }
        }

      - network_interface {
          - name               = "nic0" -> null
          - network            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/default" -> null
          - network_ip         = "10.142.0.3" -> null
          - queue_count        = 0 -> null
          - stack_type         = "IPV4_ONLY" -> null
          - subnetwork         = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/subnetworks/default" -> null
          - subnetwork_project = "cq-provider-gcp" -> null
        }

      - scheduling {
          - automatic_restart   = false -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "TERMINATE" -> null
          - preemptible         = true -> null
        }
    }

  # module.test.google_compute_instance_group.test will be destroyed
  # (because google_compute_instance_group.test is not in configuration)
  - resource "google_compute_instance_group" "test" {
      - description = "Integration test instance group" -> null
      - id          = "projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/cq-instance-group" -> null
      - instances   = [] -> null
      - name        = "cq-instance-group" -> null
      - network     = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - project     = "cq-provider-gcp" -> null
      - self_link   = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/cq-instance-group" -> null
      - size        = 0 -> null
      - zone        = "us-east1-b" -> null
    }

  # module.test.google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert will be destroyed
  # (because google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert is not in configuration)
  - resource "google_compute_managed_ssl_certificate" "gcp_compute_managed_ssl_certificates_cert" {
      - certificate_id            = 5728601797441280516 -> null
      - creation_timestamp        = "2022-05-23T03:41:47.316-07:00" -> null
      - id                        = "projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert" -> null
      - name                      = "cq-managed-cert" -> null
      - project                   = "cq-provider-gcp" -> null
      - self_link                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert" -> null
      - subject_alternative_names = [] -> null
      - type                      = "MANAGED" -> null

      - managed {
          - domains = [
              - "cloudquery.dev",
              - "ex.cloudquery.dev",
            ] -> null
        }
    }

  # module.test.google_compute_router.vpn_router will be destroyed
  # (because google_compute_router.vpn_router is not in configuration)
  - resource "google_compute_router" "vpn_router" {
      - creation_timestamp            = "2022-05-23T03:42:08.605-07:00" -> null
      - encrypted_interconnect_router = false -> null
      - id                            = "projects/cq-provider-gcp/regions/us-east1/routers/cq-us-east1-compute-vpn-router" -> null
      - name                          = "cq-us-east1-compute-vpn-router" -> null
      - network                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - project                       = "cq-provider-gcp" -> null
      - region                        = "us-east1" -> null
      - self_link                     = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/routers/cq-us-east1-compute-vpn-router" -> null

      - bgp {
          - advertise_mode     = "DEFAULT" -> null
          - advertised_groups  = [] -> null
          - asn                = 64519 -> null
          - keepalive_interval = 20 -> null
        }
    }

  # module.test.google_compute_ssl_policy.ssl-policy will be destroyed
  # (because google_compute_ssl_policy.ssl-policy is not in configuration)
  - resource "google_compute_ssl_policy" "ssl-policy" {
      - creation_timestamp = "2022-05-23T03:41:58.344-07:00" -> null
      - custom_features    = [] -> null
      - enabled_features   = [
          - "TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA",
          - "TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256",
          - "TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA",
          - "TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384",
          - "TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305_SHA256",
          - "TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA",
          - "TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256",
          - "TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA",
          - "TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384",
          - "TLS_ECDHE_RSA_WITH_CHACHA20_POLY1305_SHA256",
        ] -> null
      - fingerprint        = "u9v_Oi9pzNo=" -> null
      - id                 = "projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy" -> null
      - min_tls_version    = "TLS_1_0" -> null
      - name               = "cq-ssl-policy" -> null
      - profile            = "MODERN" -> null
      - project            = "cq-provider-gcp" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy" -> null
    }

  # module.test.google_compute_target_http_proxy.gcp_compute_target_http_proxies will be destroyed
  # (because google_compute_target_http_proxy.gcp_compute_target_http_proxies is not in configuration)
  - resource "google_compute_target_http_proxy" "gcp_compute_target_http_proxies" {
      - creation_timestamp = "2022-05-23T03:42:31.146-07:00" -> null
      - id                 = "projects/cq-provider-gcp/global/targetHttpProxies/cq-target-http-proxy" -> null
      - name               = "cq-target-http-proxy" -> null
      - project            = "cq-provider-gcp" -> null
      - proxy_bind         = false -> null
      - proxy_id           = 5175439597746183160 -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/targetHttpProxies/cq-target-http-proxy" -> null
      - url_map            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/urlMaps/cq-urlmap" -> null
    }

  # module.test.google_compute_target_https_proxy.gcp_compute_target_https_proxies will be destroyed
  # (because google_compute_target_https_proxy.gcp_compute_target_https_proxies is not in configuration)
  - resource "google_compute_target_https_proxy" "gcp_compute_target_https_proxies" {
      - creation_timestamp = "2022-05-23T03:42:31.167-07:00" -> null
      - id                 = "projects/cq-provider-gcp/global/targetHttpsProxies/cq-target-https-proxy" -> null
      - name               = "cq-target-https-proxy" -> null
      - project            = "cq-provider-gcp" -> null
      - proxy_bind         = false -> null
      - proxy_id           = 3044968959450733560 -> null
      - quic_override      = "NONE" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/targetHttpsProxies/cq-target-https-proxy" -> null
      - ssl_certificates   = [] -> null
      - ssl_policy         = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy" -> null
      - url_map            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/urlMaps/cq-urlmap" -> null
    }

  # module.test.google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy will be destroyed
  # (because google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy is not in configuration)
  - resource "google_compute_target_ssl_proxy" "gcp_compute_target_ssl_proxies_proxy" {
      - backend_service    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-another-backend-service" -> null
      - creation_timestamp = "2022-05-23T03:42:08.462-07:00" -> null
      - id                 = "projects/cq-provider-gcp/global/targetSslProxies/cq-target-ssl-proxy" -> null
      - name               = "cq-target-ssl-proxy" -> null
      - project            = "cq-provider-gcp" -> null
      - proxy_header       = "NONE" -> null
      - proxy_id           = 5319695841137974255 -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/targetSslProxies/cq-target-ssl-proxy" -> null
      - ssl_certificates   = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert",
        ] -> null
    }

  # module.test.google_compute_url_map.external_url_map will be destroyed
  # (because google_compute_url_map.external_url_map is not in configuration)
  - resource "google_compute_url_map" "external_url_map" {
      - creation_timestamp = "2022-05-23T03:42:19.762-07:00" -> null
      - default_service    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
      - fingerprint        = "Wu5WvPOYYP0=" -> null
      - id                 = "projects/cq-provider-gcp/global/urlMaps/cq-external-urlmap" -> null
      - map_id             = 1303601832524176356 -> null
      - name               = "cq-external-urlmap" -> null
      - project            = "cq-provider-gcp" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/urlMaps/cq-external-urlmap" -> null

      - host_rule {
          - hosts        = [
              - "ex.cloudquery.dev",
            ] -> null
          - path_matcher = "external-1" -> null
        }

      - path_matcher {
          - default_service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
          - name            = "external-1" -> null

          - path_rule {
              - paths   = [
                  - "/home",
                ] -> null
              - service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
            }
        }
    }

  # module.test.google_compute_url_map.url_map will be destroyed
  # (because google_compute_url_map.url_map is not in configuration)
  - resource "google_compute_url_map" "url_map" {
      - creation_timestamp = "2022-05-23T03:42:19.940-07:00" -> null
      - default_service    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
      - fingerprint        = "jnLhGAq5nig=" -> null
      - id                 = "projects/cq-provider-gcp/global/urlMaps/cq-urlmap" -> null
      - map_id             = 488080438861421540 -> null
      - name               = "cq-urlmap" -> null
      - project            = "cq-provider-gcp" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/urlMaps/cq-urlmap" -> null

      - host_rule {
          - hosts        = [
              - "beta.cloudquery.dev",
            ] -> null
          - path_matcher = "secondary" -> null
        }
      - host_rule {
          - hosts        = [
              - "cloudquery.dev",
            ] -> null
          - path_matcher = "root" -> null
        }

      - path_matcher {
          - default_service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
          - name            = "root" -> null

          - path_rule {
              - paths = [
                  - "/home",
                ] -> null

              - route_action {

                  - weighted_backend_services {
                      - backend_service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
                      - weight          = 400 -> null

                      - header_action {
                          - request_headers_to_remove  = [
                              - "RequestHeaderToRemove",
                            ] -> null
                          - response_headers_to_remove = [
                              - "ResponseHeaderToRemove",
                            ] -> null

                          - request_headers_to_add {
                              - header_name  = "RequestHeaderToAdd" -> null
                              - header_value = "RequestHeaderToAddValue" -> null
                              - replace      = true -> null
                            }

                          - response_headers_to_add {
                              - header_name  = "ResponseHeaderToAdd" -> null
                              - header_value = "ResponseHeaderToAddValue" -> null
                              - replace      = false -> null
                            }
                        }
                    }
                }
            }
          - path_rule {
              - paths   = [
                  - "/login",
                ] -> null
              - service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
            }
          - path_rule {
              - paths   = [
                  - "/static",
                ] -> null
              - service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
            }
        }
      - path_matcher {
          - default_service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
          - name            = "secondary" -> null
        }

      - test {
          - host    = "beta.cloudquery.dev" -> null
          - path    = "/healthcheck" -> null
          - service = "https://compute.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
        }
    }

  # module.test.google_kms_crypto_key.key-us-east1 will be created
  + resource "google_kms_crypto_key" "key-us-east1" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "cq-cryptokey"
      + purpose                    = "ENCRYPT_DECRYPT"

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # module.test.google_kms_crypto_key_iam_member.crypto_key will be created
  + resource "google_kms_crypto_key_iam_member" "crypto_key" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = "serviceAccount:service-163549298763@gcp-sa-secretmanager.iam.gserviceaccount.com"
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.test.google_kms_key_ring.keyring-us-east1 will be created
  + resource "google_kms_key_ring" "keyring-us-east1" {
      + id       = (known after apply)
      + location = "us-east1"
      + name     = "cq-keyring"
      + project  = (known after apply)
    }

  # module.test.google_pubsub_topic.pubsub-basic will be created
  + resource "google_pubsub_topic" "pubsub-basic" {
      + id      = (known after apply)
      + name    = "cq-topic"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.test.google_pubsub_topic_iam_member.binding will be created
  + resource "google_pubsub_topic_iam_member" "binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-163549298763@gcp-sa-secretmanager.iam.gserviceaccount.com"
      + project = "cq-provider-gcp"
      + role    = "roles/pubsub.publisher"
      + topic   = (known after apply)
    }

  # module.test.google_secret_manager_secret.secret-basic will be created
  + resource "google_secret_manager_secret" "secret-basic" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "cq-secret"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-east1"

                  + customer_managed_encryption {
                      + kms_key_name = (known after apply)
                    }
                }
            }
        }

      + rotation {
          + next_rotation_time = "2050-01-01T00:00:01Z"
          + rotation_period    = "3153600000s"
        }

      + topics {
          + name = (known after apply)
        }
    }

  # module.test.module.vpn-manage-internal.google_compute_address.vpn_gw_ip will be destroyed
  # (because google_compute_address.vpn_gw_ip is not in configuration)
  - resource "google_compute_address" "vpn_gw_ip" {
      - address            = "34.74.4.145" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2022-05-23T03:41:47.101-07:00" -> null
      - id                 = "projects/cq-provider-gcp/regions/us-east1/addresses/ip-cq-compute" -> null
      - name               = "ip-cq-compute" -> null
      - network_tier       = "PREMIUM" -> null
      - prefix_length      = 0 -> null
      - project            = "cq-provider-gcp" -> null
      - region             = "us-east1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/addresses/ip-cq-compute" -> null
      - users              = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp",
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500",
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500",
        ] -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_esp will be destroyed
  # (because google_compute_forwarding_rule.vpn_esp is not in configuration)
  - resource "google_compute_forwarding_rule" "vpn_esp" {
      - all_ports              = false -> null
      - allow_global_access    = false -> null
      - creation_timestamp     = "2022-05-23T03:42:21.121-07:00" -> null
      - id                     = "projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp" -> null
      - ip_address             = "34.74.4.145" -> null
      - ip_protocol            = "ESP" -> null
      - is_mirroring_collector = false -> null
      - label_fingerprint      = "42WmSpB8rSM=" -> null
      - labels                 = {} -> null
      - load_balancing_scheme  = "EXTERNAL" -> null
      - name                   = "cq-compute-esp" -> null
      - network_tier           = "PREMIUM" -> null
      - ports                  = [] -> null
      - project                = "cq-provider-gcp" -> null
      - region                 = "us-east1" -> null
      - self_link              = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp" -> null
      - target                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp4500 will be destroyed
  # (because google_compute_forwarding_rule.vpn_udp4500 is not in configuration)
  - resource "google_compute_forwarding_rule" "vpn_udp4500" {
      - all_ports              = false -> null
      - allow_global_access    = false -> null
      - creation_timestamp     = "2022-05-23T03:42:21.273-07:00" -> null
      - id                     = "projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500" -> null
      - ip_address             = "34.74.4.145" -> null
      - ip_protocol            = "UDP" -> null
      - is_mirroring_collector = false -> null
      - label_fingerprint      = "42WmSpB8rSM=" -> null
      - labels                 = {} -> null
      - load_balancing_scheme  = "EXTERNAL" -> null
      - name                   = "cq-compute-udp4500" -> null
      - network_tier           = "PREMIUM" -> null
      - port_range             = "4500" -> null
      - ports                  = [] -> null
      - project                = "cq-provider-gcp" -> null
      - region                 = "us-east1" -> null
      - self_link              = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500" -> null
      - target                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp500 will be destroyed
  # (because google_compute_forwarding_rule.vpn_udp500 is not in configuration)
  - resource "google_compute_forwarding_rule" "vpn_udp500" {
      - all_ports              = false -> null
      - allow_global_access    = false -> null
      - creation_timestamp     = "2022-05-23T03:42:21.446-07:00" -> null
      - id                     = "projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500" -> null
      - ip_address             = "34.74.4.145" -> null
      - ip_protocol            = "UDP" -> null
      - is_mirroring_collector = false -> null
      - label_fingerprint      = "42WmSpB8rSM=" -> null
      - labels                 = {} -> null
      - load_balancing_scheme  = "EXTERNAL" -> null
      - name                   = "cq-compute-udp500" -> null
      - network_tier           = "PREMIUM" -> null
      - port_range             = "500" -> null
      - ports                  = [] -> null
      - project                = "cq-provider-gcp" -> null
      - region                 = "us-east1" -> null
      - self_link              = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500" -> null
      - target                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_route.route[0] will be destroyed
  # (because google_compute_route.route is not in configuration)
  - resource "google_compute_route" "route" {
      - dest_range          = "10.10.12.0/24" -> null
      - id                  = "projects/cq-provider-gcp/global/routes/cq-compute-tunnel1-route1" -> null
      - name                = "cq-compute-tunnel1-route1" -> null
      - network             = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - next_hop_vpn_tunnel = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1" -> null
      - priority            = 1000 -> null
      - project             = "cq-provider-gcp" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/routes/cq-compute-tunnel1-route1" -> null
      - tags                = [] -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_vpn_gateway.vpn_gateway will be destroyed
  # (because google_compute_vpn_gateway.vpn_gateway is not in configuration)
  - resource "google_compute_vpn_gateway" "vpn_gateway" {
      - creation_timestamp = "2022-05-23T03:42:09.502-07:00" -> null
      - gateway_id         = 4892759921363704814 -> null
      - id                 = "projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
      - name               = "cq-compute" -> null
      - network            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - project            = "cq-provider-gcp" -> null
      - region             = "us-east1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_vpn_tunnel.tunnel-static[0] will be destroyed
  # (because google_compute_vpn_tunnel.tunnel-static is not in configuration)
  - resource "google_compute_vpn_tunnel" "tunnel-static" {
      - creation_timestamp              = "2022-05-23T03:42:30.543-07:00" -> null
      - detailed_status                 = "No incoming packets from peer" -> null
      - id                              = "projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1" -> null
      - ike_version                     = 2 -> null
      - local_traffic_selector          = [
          - "0.0.0.0/0",
        ] -> null
      - name                            = "cq-compute-tunnel-1" -> null
      - peer_external_gateway_interface = 0 -> null
      - peer_ip                         = "1.1.1.1" -> null
      - project                         = "cq-provider-gcp" -> null
      - region                          = "us-east1" -> null
      - remote_traffic_selector         = [
          - "0.0.0.0/0",
        ] -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1" -> null
      - shared_secret                   = (sensitive value)
      - shared_secret_hash              = "AI2vvpojiBhE40qWrDkcXtRMJShB" -> null
      - target_vpn_gateway              = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
      - tunnel_id                       = "7353531849872169977" -> null
      - vpn_gateway_interface           = 0 -> null
    }

  # module.test.module.vpn-manage-internal.random_id.ipsec_secret will be destroyed
  # (because random_id.ipsec_secret is not in configuration)
  - resource "random_id" "ipsec_secret" {
      - b64_std     = "CX0omE50HUM=" -> null
      - b64_url     = "CX0omE50HUM" -> null
      - byte_length = 8 -> null
      - dec         = "683747353046555971" -> null
      - hex         = "097d28984e741d43" -> null
      - id          = "CX0omE50HUM" -> null
    }

  # module.test.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-compute-subnet-01"] will be destroyed
  # (because google_compute_subnetwork.subnetwork is not in configuration)
  - resource "google_compute_subnetwork" "subnetwork" {
      - creation_timestamp         = "2022-05-23T03:42:08.712-07:00" -> null
      - gateway_address            = "10.10.20.1" -> null
      - id                         = "projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-compute-subnet-01" -> null
      - ip_cidr_range              = "10.10.20.0/24" -> null
      - name                       = "cq-compute-subnet-01" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - private_ip_google_access   = false -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "cq-provider-gcp" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "us-east1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-compute-subnet-01" -> null
      - stack_type                 = "IPV4_ONLY" -> null
    }

  # module.test.module.vpc.module.vpc.google_compute_network.network will be destroyed
  # (because google_compute_network.network is not in configuration)
  - resource "google_compute_network" "network" {
      - auto_create_subnetworks         = false -> null
      - delete_default_routes_on_create = false -> null
      - description                     = "Private network for cq-provider-gcp/compute" -> null
      - id                              = "projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - mtu                             = 0 -> null
      - name                            = "cq-compute-vpc" -> null
      - project                         = "cq-provider-gcp" -> null
      - routing_mode                    = "GLOBAL" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
    }

Plan: 6 to add, 0 to change, 24 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @shimonp21, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*